'use strict';


document.body.style.backgroundColor = '#D2B4DE';

// события в JS
// на JS в основном пишется UI, а это значит, что нам как-то необходимо обрабатывать действия пользователя 
// и на них реагировать, для этого и существуют события в JS 
// работа с событиями строится с помощью функций, функция выполнятеся, когда происходит определенное событие,
// JS умеет отлавливать поведение пользователя: наведение мышкой на блоки, нажатие на кнопки мыши, 
// клавиатуры, скролл страницы, изменение размеров экрана 
// у браузера на каждое такое поведение навешаны события, эти все события описаны в DOM и являются его частью
